spec/dummy/app/controllers/api/posts_controller.rb

  def index
    user = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def show
    @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @post = Post.find params[:id]
    @post.update permitted_params
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 171], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Updated"], ["updated_at", "2019-03-28 13:47:52.768935"], ["id", 171]]